### Data_Preprocessing
- 앞서 정리한 pandas 전처리 메소드 외 다른 메소드로 결측치, 이상치 처리 실습을 해봤다.
- 데이터 전처리는 이상치, 결측치 처리 뿐만 아니라 데이터 분석결과, 분석 성능을 좌지우지 하기에<br> 
  데이터 마이닝에서 가장 중요한 단계에 해당되며, 데이터를 조작하여 가공, 처리하는 모든 것을 포함한다.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("C:/Users/silan/Python/Data/iris_missing.csv")
df.head(5)

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN

In [4]:
df.isnull().sum()

Sepal_Length     7
Sepal_Width     13
Petal_Length    14
Petal_Width      6
Species          2
dtype: int64

In [5]:
df_na = df.head(7)

In [6]:
df_na

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [8]:
df_na['Sepal_Length'].isna()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
Name: Sepal_Length, dtype: bool

In [9]:
df_na['Sepal_Length'].notna() # isna()와 반대되는 결과

0     True
1     True
2     True
3     True
4     True
5     True
6    False
Name: Sepal_Length, dtype: bool

In [10]:
df_na.isna() # 축 방향 적용

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width  Species
0         False         True          True        False    False
1         False        False         False        False    False
2         False        False         False        False     True
3         False        False         False        False    False
4         False        False         False        False     True
5         False        False         False        False    False
6          True         True          True         True    False

In [11]:
df_na.isna().sum() # 각 변수별 결측치 개수

Sepal_Length    1
Sepal_Width     2
Petal_Length    2
Petal_Width     1
Species         2
dtype: int64

In [12]:
df_na.isna().sum(axis = 1) # 각 row 별 결측치 개수

0    2
1    0
2    1
3    0
4    1
5    0
6    4
dtype: int64

In [13]:
df_na.isna().sum(axis = 0) # 각 column 별 결측치 개수

Sepal_Length    1
Sepal_Width     2
Petal_Length    2
Petal_Width     1
Species         2
dtype: int64

In [15]:
df_na.fillna(value = {'Sepal_Length': 999})

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6         999.0          NaN           NaN          NaN  setosa

In [21]:
df_na.fillna(value = {'Sepal_Length': 999,
                     'Sepal_Width': 999})

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1        999.0           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6         999.0        999.0           NaN          NaN  setosa

In [22]:
df_na

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1        999.0           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6         999.0        999.0           NaN          NaN  setosa

In [23]:
# 특정 컬럼 미지정 시 일괄로 채워짐

df_na.fillna(999)

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1        999.0         999.0          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     999
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     999
5           5.4          3.9           1.7          0.4  setosa
6         999.0        999.0         999.0        999.0  setosa

In [24]:
df_na['Sepal_Width'].mean() # inplace = True 되어 있어서 평균이 크게 나옴

287.8285714285715

In [31]:
df_na2 = pd.read_csv("C:/Users/silan/Python/Data/iris_missing.csv").head(7)
df_na2

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

### dropna( axis: 'Axis' = 0, how: 'str' = 'any' or 'all')

In [32]:
df_na2.dropna(how = 'all')

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [34]:
df_na2.iloc[:, :-1] # 마지막 행의 열을 제외

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
0           5.1          NaN           NaN          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4
6           NaN          NaN           NaN          NaN

In [35]:
df_na2.iloc[:, :-1].dropna(how = 'all') # 행의 모든 값이 결측치일 때 삭제됨

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
0           5.1          NaN           NaN          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4

In [39]:
print(df['Sepal_Length'].max())
print(df['Sepal_Length'].min())
print(df['Sepal_Length'].mean())

999.0
4.3
12.750694444444447

In [40]:
print(df['Sepal_Length'].quantile()) # default: 0.5

5.8

In [41]:
print(df['Sepal_Length'].median())

5.8

In [43]:
print(df['Sepal_Length'].quantile(q = 0.25)) # 1 사분위수
print(df['Sepal_Length'].quantile(q = 0.5)) # 2 사분위수
print(df['Sepal_Length'].quantile(q = 0.75)) # 3 사분위수

5.1
5.8
6.4

### 이상치(Outlier)
- IQR: interquartile range (Q3 - Q1)
- low_outlier: 1st quantile - 1.5 * IQR
- high_outlier: 3rd quantile + 1.5 * IQR

In [49]:
iqr = (df['Sepal_Length'].quantile(q = 0.75) - df['Sepal_Length'].quantile(q = 0.25))
cond1 = df['Sepal_Length'] < df['Sepal_Length'].quantile(q = 0.25) - 1.5 * iqr
cond2 = df['Sepal_Length'] > df['Sepal_Length'].quantile(q = 0.75) + 1.5 * iqr

In [52]:
print(cond1.sum())
print(cond2.sum())

0
1

In [58]:
df[cond2] # 이상치인 행 출력

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
6         999.0        999.0           NaN          NaN  setosa